VU-Civic/firmware-ai/Middlewares/ST/AI/Npu/Devices/STM32N6XX/npu_cache.c
#include "npu_cache.h"
#include "stm32n6xx_hal_cacheaxi.h"

static CACHEAXI_HandleTypeDef hcacheaxi_s;

void npu_cache_init(void)
{
  hcacheaxi_s.Instance = CACHEAXI;
  HAL_CACHEAXI_Init(&hcacheaxi_s);
}

void npu_cache_enable(void)
{
  HAL_StatusTypeDef status;
  do { status = HAL_CACHEAXI_Enable(&hcacheaxi_s); } while (status == HAL_BUSY);
}

void npu_cache_disable(void)
{
  HAL_StatusTypeDef status;
  do { status = HAL_CACHEAXI_Disable(&hcacheaxi_s); } while (status == HAL_BUSY);
}

void npu_cache_invalidate(void)
{
  HAL_CACHEAXI_Invalidate(&hcacheaxi_s);
}

void npu_cache_clean_range(uint32_t start_addr, uint32_t end_addr)
{
  HAL_CACHEAXI_CleanByAddr(&hcacheaxi_s, (uint32_t*)start_addr, end_addr-start_addr);
}

void npu_cache_clean_invalidate_range(uint32_t start_addr, uint32_t end_addr)
{
  HAL_CACHEAXI_CleanInvalidByAddr(&hcacheaxi_s, (uint32_t*)start_addr, end_addr-start_addr);
}

void NPU_CACHE_IRQHandler(void)
{
  __NOP();
}
